gt/L04_rationalizability/rationalizability.html


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Iterative elimination of strictly dominated strategies in Cournot</h2>
<div class="outline-text-2" id="text-1">
<p>
Here we want to repeat the iterative elimination of strictly dominated actions in the Cournot game. We will use a simple two firm Cournot game with inverse demand
</p>

<p>
$$p(q_1,q_2)=\max(1-q_1-q_2,0)$$
</p>

<p>
and marginal costs equal to \(c\in(0,1)\). The action set of each player is \([0,1]\). This means that the best response functions are
$$br_1(q_2)=\max\left(\frac{1-q_2-c}{2},0\right)$$
$$br_2(q_1)=\max\left(\frac{1-q_1-c}{2},0\right).$$
</p>

<p>
We will now eliminate in the first round all actions of player 1 that cannot be a best response for any belief P1 might have. If P1 believes that P2 uses the mixed strategy given by the probability distribution \(F(q_2)\), his expected profits are
$$\pi(q_1)= \int_0^1q_1(\max(1-q_1-q_2,0)-c)\,dF(q_2).$$
From the first order condition, we get the generalized best response
$$q_1(F(q_2))=\max\left(\frac{\int_0^11-q_2-c\;dF(q_2)}{2},0\right).$$
If \(F\) puts all probability mass on 1, this best response is 0. If \(F\) puts all probability mass on 0, the best response is \((1-c)/2\). For all other distributions, the best response is between 0 and \((1-c)/2\). Hence, we can eliminate all quantities greater than \((1-c)/2\): There is no belief such that these quantities would be a best response. 
</p>

<p>
In the next iteration, we ask which actions can be best responses by P2 given that P1 uses only actions in \([0,(1-c)/2]\). Recall that \(br_2(0)=(1-c)/2\) and \(br_2((1-c)/2)=(1-c)/4\). For any strategy \(F(q_1)\) with support in \([0,(1-c)/2]\), P2's best response in somewhere between \((1-c)/4\) and \((1-c)/2\) (verify!).
</p>

<p>
Now we can go back to P1&#x2026;
</p>

<p>
Computers are better at iterations than humans; so let's feed this problem into the machine. For simplicity, we use \(c=0\) although this makes the example formally incorrect: For \(c=0\), any quantity \(q_i\geq0\) is a best response to \(q_j=1\) and therefore the best response function above and the elimination are incorrect. For this example, you should therefore think of \(c=0\) as the limit case where \(c=\epsilon>0\) and \(\epsilon\rightarrow0\). For any \(c>0\), the only best response to \(q_j=1\) is \(0\) and we are in the clear.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">import</span> numpy <span style="color: #859900;">as</span> np
<span style="color: #859900;">from</span> matplotlib <span style="color: #859900;">import</span> pyplot <span style="color: #859900;">as</span> plt
<span style="color: #859900;">from</span> matplotlib <span style="color: #859900;">import</span> animation
<span style="color: #859900;">from</span> prettytable <span style="color: #859900;">import</span> PrettyTable

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">best response function</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">br</span>(q):
    <span style="color: #859900;">return</span> (1-q)/2.

<span style="color: #268bd2;">br_vec</span> = np.vectorize(br)

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">inverse of best response function</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">br_inv</span>(q):
    <span style="color: #859900;">return</span> 1-2*q

<span style="color: #268bd2;">br_inv_vec</span> = np.vectorize(br_inv)

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">calculate the range of best response if the other plays qj Qj</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">starting from Qj=[0,1], iterate this i times</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">iterative_br</span>(i):
    <span style="color: #268bd2;">lower</span>,<span style="color: #268bd2;">upper</span> = 0.,1.
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">xrange</span>(i):
        <span style="color: #268bd2;">lower</span>,<span style="color: #268bd2;">upper</span> = br(upper),br(lower)
    <span style="color: #859900;">return</span> lower, upper

<span style="color: #268bd2;">t</span> = PrettyTable([<span style="color: #2aa198;">'iteration'</span>,<span style="color: #2aa198;">'lower bound'</span>,<span style="color: #2aa198;">'upper bound'</span>])

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(0,11,1):
    <span style="color: #268bd2;">dummy</span> = iterative_br(i)
    t.add_row([i,<span style="color: #859900;">round</span>(dummy[0],3),<span style="color: #859900;">round</span>(dummy[1],3)])

<span style="color: #859900;">print</span> t
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... ... ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... ... ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... ... ... ... ... ... ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... ... ... &gt;&gt;&gt; +-----------+-------------+-------------+
| iteration | lower bound | upper bound |
+-----------+-------------+-------------+
|     0     |     0.0     |     1.0     |
|     1     |     0.0     |     0.5     |
|     2     |     0.25    |     0.5     |
|     3     |     0.25    |    0.375    |
|     4     |    0.313    |    0.375    |
|     5     |    0.313    |    0.344    |
|     6     |    0.328    |    0.344    |
|     7     |    0.328    |    0.336    |
|     8     |    0.332    |    0.336    |
|     9     |    0.332    |    0.334    |
|     10    |    0.333    |    0.334    |
+-----------+-------------+-------------+
</pre>

<p>
As you see, we get pretty quickly pretty close to the Nash equilibrium and indeed in the limit only the Nash equilibrium \((1/3,1/3)\) remains. That is, the Nash equilibrium action is the only rationalizable action of the simple Cournot game! The following visualizes this.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">fig</span> = plt.figure()
<span style="color: #268bd2;">ax</span> = plt.axes(xlim=(0,1), ylim=(0,1))
plt.ylabel(<span style="color: #2aa198;">'$q_1$'</span>)
plt.xlabel(<span style="color: #2aa198;">'$q_2$'</span>)
line1, = ax.plot([],[],<span style="color: #2aa198;">'b'</span>,linewidth=1.5)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">not yet eliminated q1 on best response function</span>
line2, = ax.plot([],[],<span style="color: #2aa198;">'r'</span>,linewidth=1.5)
ratio1, = ax.plot([],[],<span style="color: #2aa198;">'b'</span>,linewidth=3)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">marks not yet eliminated q1 on axis</span>
ratio2, = ax.plot([],[],<span style="color: #2aa198;">'r'</span>,linewidth=3)
br1,   = ax.plot([],[],<span style="color: #2aa198;">'b:'</span>,linewidth=1.5)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">best response function of P1</span>
br2,   = ax.plot([],[],<span style="color: #2aa198;">'r:'</span>,linewidth=1.5)
plt.legend([br1,br2,ratio1,ratio2],[<span style="color: #2aa198;">'$br_1(q_2)$'</span>,<span style="color: #2aa198;">'$br_2(q_1)$'</span>,<span style="color: #2aa198;">'not yet eliminated $q_1$'</span>,<span style="color: #2aa198;">'not yet eliminated $q_1$'</span>])

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">basic plot that is held fixed through out all iterations</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">init</span>():
    line1.set_data([],[])
    line2.set_data([],[])
    ratio1.set_data([],[])
    ratio2.set_data([],[])
    <span style="color: #268bd2;">x</span> = np.linspace(0,1,50)
    <span style="color: #268bd2;">br_curve</span> = br_vec(x)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">np.ndarray(br_vec(x))</span>
    br1.set_data(x,br_curve)
    br2.set_data(br_curve,x)
    <span style="color: #859900;">return</span> line1,line2,br1,br2,ratio1,ratio2

<span style="color: #859900;">def</span> <span style="color: #268bd2;">animate</span>(i):
    <span style="color: #859900;">if</span> i % 2 != 0:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">true if i is odd</span>
        <span style="color: #268bd2;">temp</span> = iterative_br(i)
        <span style="color: #268bd2;">y1</span> = np.linspace(temp[0],temp[1],50)
        <span style="color: #268bd2;">x1</span> = br_inv_vec(y1)
        <span style="color: #268bd2;">temp</span> = iterative_br(i-1)
        <span style="color: #268bd2;">x2</span> = np.linspace(temp[0],temp[1],50)
        <span style="color: #268bd2;">y2</span> = br_inv_vec(x2)
    <span style="color: #859900;">else</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">if i is even</span>
        <span style="color: #268bd2;">temp</span> = iterative_br(i)
        <span style="color: #268bd2;">x2</span> = np.linspace(temp[0],temp[1],50)
        <span style="color: #268bd2;">y2</span> = br_inv_vec(x2)
        <span style="color: #268bd2;">temp</span> = iterative_br(i-1)
        <span style="color: #268bd2;">y1</span> = np.linspace(temp[0],temp[1],50)
        <span style="color: #268bd2;">x1</span> = br_inv_vec(y1)
    <span style="color: #268bd2;">helpratio</span> = np.zeros(50)+0.002
    line1.set_data(x1,y1)
    ratio1.set_data(helpratio,y1)
    line2.set_data(x2,y2)
    ratio2.set_data(x2,helpratio)
    <span style="color: #859900;">return</span> line1,line2,ratio1,ratio2

<span style="color: #268bd2;">anim</span> = animation.FuncAnimation(fig,animate,init_func=init,frames=10,repeat=<span style="color: #2aa198;">False</span>,interval = 1000,blit=<span style="color: #2aa198;">True</span>)

anim.save(<span style="color: #2aa198;">'Cournot_iterative.mp4'</span>,fps=1,extra_args=[<span style="color: #2aa198;">'-vcodec'</span>,<span style="color: #2aa198;">'libx264'</span>])

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">plt.show()</span>
<span style="color: #859900;">return</span> <span style="color: #2aa198;">'Cournot_iterative.mp4'</span>
</pre>
</div>

<p>
<a href="./Cournot_iterative.mp4">./Cournot_iterative.mp4</a>
</p>
</div>
</div>
