papers/privacy/presentations/L04_rationalizability/rationalizability.org
* Calculating the set of rationalizable actions in finite, two-player games
Here we want to write a small program that calculates the set of rationalizable actions in a finite two player game. We use the following two results mentioned in the lecture:

- the set of rationalizable actions is the set of actions surviving iterative deletion of strictly dominated actions
- an action is strictly dominated if and only if it is a never-best-response.

We will therefore iteratively delete strictly dominated actions. We determine that an action is strictly dominated by establishing that it is a never-best-response. That is, $a$ is strictly dominate if there is no  belief with support in the remaining actions of the other player such that $a$ is a best response given this belief. If we denote the set of actions of player $-i$ that are not deleted (yet) as $\tilde A_{-i}$, then $a$ is strictly dominate if there is no belief $\mu$ on $\tilde A_{-i}$ solving the following system of inequalities

$$\sum_{a_{-i}\in \tilde A_{-i}} u_i(a_i,a_{-i}) \mu(a_{-i})\geq  \sum_{a_{-i}\in \tilde A_{-i}} u_i(a_i',a_{-i}) \mu(a_{-i}) \qquad \text{ for all }a_i'\in \tilde A_i.$$

This system is equivalent to 

$$\sum_{a_{-i}\in \tilde A_{-i}} (u_i(a_i,a_{-i})-u_i(a_i',a_{-i})) \mu(a_{-i})\leq 0  \qquad \text{ for all }a_i'\in \tilde A_i.$$

This is a simple system of linear inequalities and linear program solvers are able to check whether it has a solution or not. So we will start with the first action of P1 and ask a linear program solver whether these inequalities have a solution $\mu$. If not, we remove this action from the game. After that we do the same with the second action of P1 and so on. When we have gone through all actions of P1, we move on to P2. If either for P1 or for P2 an action was removed, we start again, i.e. we go back to P1 and start with his first remaining action (this is the next "iteration" in "iterative deletion of strictly dominated actions"). Then P2... We stop when in one iteration neither an action of P1 nor an action of P2 was removed.

I use the following example game in the code below:

#+CAPTION: Example game
#+ATTR_HTML: :border 2 :rules all :frame border :align center
|   | L    | C    | R    |
|---+------+------+------|
| U | 0,0  | 3,1  | 5,-1 |
| M | 1,3  | 1,1  | 1,-1 |
| B | -1,1 | -2,0 | 2,2  |

#+BEGIN_SRC python :exports both :results output
  """" We give a game table (called "payoffs"; see below) to this program. 
  It then returns the same game but with all non-rationalizable actions removed."""
  from prettytable import PrettyTable
  from openopt import LP
  from operator import *
  #these are the payoffs from the game table; each row in the game table is a list of payoff tuples; 
  #the game table is then a list of these rows
  payoffs = [[(0.,0.),(3.,1.),(5.,-1.)],[(1.,3.),(1.,1.),(1.,-1.)],[(-1.,1.),(-2.,0.),(2.,2.)]]


  #constructs payoffs of only player 1 from the payoffs in "game"
  def payoff1_builder(game):
      payoff1 = []
      for i in game:
          temp = []
          for j in i:
              temp.append(j[0])
          payoff1.append(temp)
      return payoff1

  #constructs payoffs of only player 1 from the payoffs in "game"
  def payoff2_builder(game):
      payoff2 = []
      for i in payoffs:
          temp = []
          for j in i:
              temp.append(j[1])
          payoff2.append(temp)
      return payoff2


  #this function gets a game and removes all rows from the game that correspond to dominated actions of P1; 
  #the game without these rows is returned
  def delete_dom_act_P1(game):
      payoff1 = payoff1_builder(game)
      temp_payoff1 = payoff1
      temp_game = game
      f = [0.]*len(payoff1[0])#dummy objective used below
      lb = [0.]*len(payoff1[0])
      ub = [1.]*len(payoff1[0])
      Aeq = [[1.]*len(payoff1[0])]
      beq = (1.,)
      j = 0
      while j<len(payoff1):
          action = payoff1[j]
          A = []
          b = []
          for other_action in payoff1:
              A.append(map(sub, other_action, action))#elementwise difference
              b.append(0.)
          p = LP(f, A=A,b=b,lb=lb,ub=ub,Aeq=Aeq,beq=beq)#we use the artificial minimization problem under the constraint that action gives a weakly higher payoff than any other action; if no feasible solution is obtained than action is dominated
          p.iprint = -1
          r = p.minimize('pclp')
          if r.stopcase!=1:#if no feasible solution was obtained then action is dominated...
              temp_game.remove(game[j])#...and therefore the row corresponding to this action is removed
          j+=1
      return temp_game

  #this function takes a game and reverses the roles of the players, 
  #i.e. the returned game is the same as the given one but now P1 is column player and P2 is row player
  def interchange_players(game):
      changed_payoff = []
      for row in game:#this loop switches every payoff tuple in the game matrix
          changed_row = []
          for payoff_pair in row:
              n,m = payoff_pair
              changed_row.append((m,n))
          changed_payoff.append(changed_row)
      players_interchanged = [list(x) for x in zip(*changed_payoff)]#transposes the payoff matrix such that P2's actions are in rows instead of columns; 
      return players_interchanged

  #deletes dominated actions of P2 in game; 
  #we do this by interchanging the roles of P1 and P2 and feeding this "switched game" 
  #into the function that deletes dominated actions for P1
  def delete_dom_act_P2(game):
      switched_game = interchange_players(game)
      switched_game_without_dom_act = delete_dom_act_P1(switched_game)
      switched_back_game = interchange_players(switched_game_without_dom_act)
      return switched_back_game
      

  flag = 0#will be zero as long as not all dominated actions are removed yet

  while flag==0:
      temp1 = delete_dom_act_P1(payoffs)
      temp2 = delete_dom_act_P2(temp1)
      if temp2 == payoffs:
          flag = 1
      else:
          payoffs = temp2

  print 'game table without non-rationalizable actions is'
  t = PrettyTable(payoffs[0])
  j = 1
  while j<len(payoffs):
      t.add_row(payoffs[j])
      j+=1

  print t

#+END_SRC

#+RESULTS:

