gt/L04_rationalizability/rationalizability.html


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Calculating the set of rationalizable actions in finite, two-player games</h2>
<div class="outline-text-2" id="text-2">
<p>
Here we want to write a small program that calculates the set of rationalizable actions in a finite two player game. We use the following two results mentioned in the lecture:
</p>

<ul class="org-ul">
<li>the set of rationalizable actions is the set of actions surviving iterative deletion of strictly dominated actions
</li>
<li>an action is strictly dominated if and only if it is a never-best-response.
</li>
</ul>

<p>
We will therefore iteratively delete strictly dominated actions. We determine that an action is strictly dominated by establishing that it is a never-best-response. That is, \(a\) is strictly dominate if there is no  belief with support in the remaining actions of the other player such that \(a\) is a best response given this belief. If we denote the set of actions of player \(-i\) that are not deleted (yet) as \(\tilde A_{-i}\), then \(a\) is strictly dominate if there is no belief \(\mu\) on \(\tilde A_{-i}\) solving the following system of inequalities
</p>

<p>
$$\sum_{a_{-i}\in \tilde A_{-i}} u_i(a_i,a_{-i}) \mu(a_{-i})\geq  \sum_{a_{-i}\in \tilde A_{-i}} u_i(a_i',a_{-i}) \mu(a_{-i}) \qquad \text{ for all }a_i'\in \tilde A_i.$$
</p>

<p>
This system is equivalent to 
</p>

<p>
$$\sum_{a_{-i}\in \tilde A_{-i}} (u_i(a_i,a_{-i})-u_i(a_i',a_{-i})) \mu(a_{-i})\leq 0  \qquad \text{ for all }a_i'\in \tilde A_i.$$
</p>

<p>
This is a simple system of linear inequalities and linear program solvers are able to check whether it has a solution or not. So we will start with the first action of P1 and ask a linear program solver whether these inequalities have a solution \(\mu\). If not, we remove this action from the game. After that we do the same with the second action of P1 and so on. When we have gone through all actions of P1, we move on to P2. If either for P1 or for P2 an action was removed, we start again, i.e. we go back to P1 and start with his first remaining action (this is the next "iteration" in "iterative deletion of strictly dominated actions"). Then P2&#x2026; We stop when in one iteration neither an action of P1 nor an action of P2 was removed.
</p>

<p>
I use the following example game in the code below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" align="center">
<caption class="t-above"><span class="table-number">Table 1:</span> Example game</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">L</th>
<th scope="col" class="left">C</th>
<th scope="col" class="left">R</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">U</td>
<td class="left">0,0</td>
<td class="left">3,1</td>
<td class="left">5,-1</td>
</tr>

<tr>
<td class="left">M</td>
<td class="left">1,3</td>
<td class="left">1,1</td>
<td class="left">1,-1</td>
</tr>

<tr>
<td class="left">B</td>
<td class="left">-1,1</td>
<td class="left">-2,0</td>
<td class="left">2,2</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa198;">"""" We give a game table (called "payoffs"; see below) to this program. </span>
<span style="color: #2aa198;">It then returns the same game but with all non-rationalizable actions removed."""</span>
<span style="color: #859900;">from</span> prettytable <span style="color: #859900;">import</span> PrettyTable
<span style="color: #859900;">from</span> openopt <span style="color: #859900;">import</span> LP
<span style="color: #859900;">from</span> operator <span style="color: #859900;">import</span> *
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">these are the payoffs from the game table; each row in the game table is a list of payoff tuples; </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the game table is then a list of these rows</span>
<span style="color: #268bd2;">payoffs</span> = [[(0.,0.),(3.,1.),(5.,-1.)],[(1.,3.),(1.,1.),(1.,-1.)],[(-1.,1.),(-2.,0.),(2.,2.)]]


<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">constructs payoffs of only player 1 from the payoffs in "game"</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">payoff1_builder</span>(game):
    <span style="color: #268bd2;">payoff1</span> = []
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> game:
        <span style="color: #268bd2;">temp</span> = []
        <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> i:
            temp.append(j[0])
        payoff1.append(temp)
    <span style="color: #859900;">return</span> payoff1

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">constructs payoffs of only player 1 from the payoffs in "game"</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">payoff2_builder</span>(game):
    <span style="color: #268bd2;">payoff2</span> = []
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> payoffs:
        <span style="color: #268bd2;">temp</span> = []
        <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> i:
            temp.append(j[1])
        payoff2.append(temp)
    <span style="color: #859900;">return</span> payoff2


<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">this function gets a game and removes all rows from the game that correspond to dominated actions of P1; </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the game without these rows is returned</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">delete_dom_act_P1</span>(game):
    <span style="color: #268bd2;">payoff1</span> = payoff1_builder(game)
    <span style="color: #268bd2;">temp_payoff1</span> = payoff1
    <span style="color: #268bd2;">temp_game</span> = game
    <span style="color: #268bd2;">f</span> = [0.]*<span style="color: #859900;">len</span>(payoff1[0])<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy objective used below</span>
    <span style="color: #268bd2;">lb</span> = [0.]*<span style="color: #859900;">len</span>(payoff1[0])
    <span style="color: #268bd2;">ub</span> = [1.]*<span style="color: #859900;">len</span>(payoff1[0])
    <span style="color: #268bd2;">Aeq</span> = [[1.]*<span style="color: #859900;">len</span>(payoff1[0])]
    <span style="color: #268bd2;">beq</span> = (1.,)
    <span style="color: #268bd2;">j</span> = 0
    <span style="color: #859900;">while</span> j&lt;<span style="color: #859900;">len</span>(payoff1):
        <span style="color: #268bd2;">action</span> = payoff1[j]
        <span style="color: #268bd2;">A</span> = []
        <span style="color: #268bd2;">b</span> = []
        <span style="color: #859900;">for</span> other_action <span style="color: #859900;">in</span> payoff1:
            A.append(<span style="color: #859900;">map</span>(sub, other_action, action))<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">elementwise difference</span>
            b.append(0.)
        <span style="color: #268bd2;">p</span> = LP(f, A=A,b=b,lb=lb,ub=ub,Aeq=Aeq,beq=beq)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">we use the artificial minimization problem under the constraint that action gives a weakly higher payoff than any other action; if no feasible solution is obtained than action is dominated</span>
        <span style="color: #268bd2;">p.iprint</span> = -1
        <span style="color: #268bd2;">r</span> = p.minimize(<span style="color: #2aa198;">'pclp'</span>)
        <span style="color: #859900;">if</span> r.stopcase!=1:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">if no feasible solution was obtained then action is dominated...</span>
            temp_game.remove(game[j])<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">...and therefore the row corresponding to this action is removed</span>
        <span style="color: #268bd2;">j</span>+=1
    <span style="color: #859900;">return</span> temp_game

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">this function takes a game and reverses the roles of the players, </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">i.e. the returned game is the same as the given one but now P1 is column player and P2 is row player</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">interchange_players</span>(game):
    <span style="color: #268bd2;">changed_payoff</span> = []
    <span style="color: #859900;">for</span> row <span style="color: #859900;">in</span> game:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">this loop switches every payoff tuple in the game matrix</span>
        <span style="color: #268bd2;">changed_row</span> = []
        <span style="color: #859900;">for</span> payoff_pair <span style="color: #859900;">in</span> row:
            <span style="color: #268bd2;">n</span>,<span style="color: #268bd2;">m</span> = payoff_pair
            changed_row.append((m,n))
        changed_payoff.append(changed_row)
    <span style="color: #268bd2;">players_interchanged</span> = [<span style="color: #859900;">list</span>(x) <span style="color: #859900;">for</span> x <span style="color: #859900;">in</span> <span style="color: #859900;">zip</span>(*changed_payoff)]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">transposes the payoff matrix such that P2's actions are in rows instead of columns; </span>
    <span style="color: #859900;">return</span> players_interchanged

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes dominated actions of P2 in game; </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">we do this by interchanging the roles of P1 and P2 and feeding this "switched game" </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">into the function that deletes dominated actions for P1</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">delete_dom_act_P2</span>(game):
    <span style="color: #268bd2;">switched_game</span> = interchange_players(game)
    <span style="color: #268bd2;">switched_game_without_dom_act</span> = delete_dom_act_P1(switched_game)
    <span style="color: #268bd2;">switched_back_game</span> = interchange_players(switched_game_without_dom_act)
    <span style="color: #859900;">return</span> switched_back_game


<span style="color: #268bd2;">flag</span> = 0<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will be zero as long as not all dominated actions are removed yet</span>

<span style="color: #859900;">while</span> flag==0:
    <span style="color: #268bd2;">temp1</span> = delete_dom_act_P1(payoffs)
    <span style="color: #268bd2;">temp2</span> = delete_dom_act_P2(temp1)
    <span style="color: #859900;">if</span> temp2 == payoffs:
        <span style="color: #268bd2;">flag</span> = 1
    <span style="color: #859900;">else</span>:
        <span style="color: #268bd2;">payoffs</span> = temp2

<span style="color: #859900;">print</span> <span style="color: #2aa198;">'game table without non-rationalizable actions is'</span>
<span style="color: #268bd2;">t</span> = PrettyTable(payoffs[0])
<span style="color: #268bd2;">j</span> = 1
<span style="color: #859900;">while</span> j&lt;<span style="color: #859900;">len</span>(payoffs):
    t.add_row(payoffs[j])
    <span style="color: #268bd2;">j</span>+=1

<span style="color: #859900;">print</span> t
</pre>
</div>

<pre class="example">
game table without non-rationalizable actions is
+------------+------------+
| (0.0, 0.0) | (3.0, 1.0) |
+------------+------------+
| (1.0, 3.0) | (1.0, 1.0) |
+------------+------------+
</pre>
</div>
</div>
