gt/L04_rationalizability/rationalizability.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Iterative elimination of strictly dominated strategies for finite n-player games</h2>
<div class="outline-text-2" id="text-3">
<p>
We generalize the code above for \(n\geq 2\) players. Although it might be a bit counter-intuitive for 2-player games, we will use a slightly different notation for the payoffs: They are now numpy arrays and for two player games we go column by column (instead of row by row). A \(n+1\) player game is then simply a numpy array where each element is an \(n\) player game (and corresponds to a fixed action of player \(n+1\)).
</p>

<p>
The example used here is the following where each player has a single rationalizable action.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" align="center">
<caption class="t-above"><span class="table-number">Table 2:</span> P3 plays <b>0</b></caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">0</th>
<th scope="col" class="left">1</th>
<th scope="col" class="left">2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left">1,0,1</td>
<td class="left">4,1,2</td>
<td class="left">1,-1,1</td>
</tr>

<tr>
<td class="left"><b>1</b></td>
<td class="left">0,3,2</td>
<td class="left">1,1,1</td>
<td class="left">4,-1,1</td>
</tr>

<tr>
<td class="left"><b>2</b></td>
<td class="left">-1,1,0</td>
<td class="left">2,0,0</td>
<td class="left">2,2,0</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" align="center">
<caption class="t-above"><span class="table-number">Table 3:</span> P3 plays <b>1</b></caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">0</th>
<th scope="col" class="left">1</th>
<th scope="col" class="left">2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left">0,0,0</td>
<td class="left">3,1,0</td>
<td class="left">5,-1,0</td>
</tr>

<tr>
<td class="left"><b>1</b></td>
<td class="left">1,3,1</td>
<td class="left">1,1,0</td>
<td class="left">1,-1,0</td>
</tr>

<tr>
<td class="left"><b>2</b></td>
<td class="left">-1,1,3</td>
<td class="left">-2,0,2</td>
<td class="left">2,2,3</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa198;">"""" We give a game table (called "payoffs"; see below) to this program. </span>
<span style="color: #2aa198;">It then returns the same game but with all non-rationalizable actions removed."""</span>

<span style="color: #859900;">from</span> openopt <span style="color: #859900;">import</span> LP
<span style="color: #859900;">import</span> numpy <span style="color: #859900;">as</span> np
<span style="color: #859900;">from</span> operator <span style="color: #859900;">import</span> *
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">2player game from above</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">payoffs = np.array([[[0.,0.],[1.,3.],[-1.,1]],[[3.,1.],[1.,1.],[-2.,-0.]],[[5.,-1.],[1.,-1.],[2.,2.]]])</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">payoffs = np.array([[[0.,0.],[1.,3.]],[[1.,1.],[2.,1.]]])</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">3player game (3*3*2 action) in which only (0,1,0) is rationalizable</span>
<span style="color: #268bd2;">payoffs</span> = np.array([[[[1.,0.,1.],[0.,3.,2.],[-1.,1,0.]],[[4.,1.,2.],[1.,1.,1.],[2.,0.,0.]],[[1.,-1.,1.],[4.,-1.,1.],[2.,2.,0.]]],[[[0.,0.,0.],[1.,3.,1.],[-1.,1,3.]],[[3.,1.,0.],[1.,1.,0.],[-2.,-0.,2.]],[[5.,-1.,0.],[1.,-1.,0.],[2.,2.,3.]]]])




<span style="color: #268bd2;">dim</span> = payoffs.shape

<span style="color: #268bd2;">n</span> = payoffs.ndim-1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">number of players</span>
<span style="color: #268bd2;">no_a</span> = [] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will contain number of actions available for each player</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">as the first number is number of actions of last player etc., we eventually turn the list around</span>
<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> dim[:-1]:
    no_a.append(i)
<span style="color: #268bd2;">no_a</span> = no_a[::-1]

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">constructs payoffs of only player i when playing ai from the payoffs in "game", returns a "flat" vector</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">payoffi_builder</span>(game,ai,i):
    <span style="color: #268bd2;">j</span> = n-1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the next few lines define a list of slice object to extract i's payoffs when he plays ai from the payoff matrix; </span>
      <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">recall that the first index denotes the action of the last player in payoffs!</span>
    <span style="color: #268bd2;">obj</span> = ()
    <span style="color: #859900;">while</span> j&gt;i:
        <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #859900;">slice</span>(0,<span style="color: #2aa198;">None</span>,1),)
        <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #859900;">slice</span>(ai,ai+1,2),)
    <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #859900;">while</span> j&gt;=0:
        <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #859900;">slice</span>(0,<span style="color: #2aa198;">None</span> ,1),)
        <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #859900;">slice</span>(i,i+1,2),)
    <span style="color: #268bd2;">payoffi</span> = game[obj]
    <span style="color: #859900;">return</span> payoffi.flatten()


<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">this function gets a game and removes all actions from the game that correspond to dominated actions of Pi; </span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the game without these actions is returned</span>
<span style="color: #859900;">def</span> <span style="color: #268bd2;">delete_dom_act_Pi</span>(game,i):
    <span style="color: #268bd2;">no_a_game</span> = <span style="color: #859900;">list</span>(game.shape) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will contain number of actions available for each player</span>
    no_a_game.pop()<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes last element of list which simply was n: the number of payoffs in each action profile</span>
    <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">as the first number is number of actions of last player etc., we turn the list around</span>
    <span style="color: #268bd2;">no_a_game</span> = no_a_game[::-1]
    <span style="color: #268bd2;">no_a_i</span> = no_a_game.pop(i)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">remove the number of actions of player i from no_a_game and put it in no_a_i</span>
    <span style="color: #859900;">if</span> no_a_i==1:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">if a single action remains it cannot be dominated</span>
        <span style="color: #859900;">return</span> game
    <span style="color: #268bd2;">var_no</span> = np.prod(no_a_game)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">size of the support of mu</span>
    <span style="color: #859900;">if</span> var_no == 1:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">special case: the support of mu has a single elment</span>
        <span style="color: #859900;">return</span> del_dom_a_Pi_point_belief(game, i,no_a_i)
    <span style="color: #268bd2;">temp_game</span> = game
    <span style="color: #268bd2;">f</span> = [0.]*var_no   <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy objective used below</span>
    <span style="color: #268bd2;">lb</span> = [0.]*var_no
    <span style="color: #268bd2;">ub</span> = [1.]*var_no
    <span style="color: #268bd2;">Aeq</span> = [[1.]*var_no]
    <span style="color: #268bd2;">beq</span> = (1.,)
    <span style="color: #268bd2;">j</span> = 0
    <span style="color: #859900;">while</span> j&lt;no_a_i:
        <span style="color: #268bd2;">u_action</span> = payoffi_builder(game,j,i)
        <span style="color: #268bd2;">A</span> = []
        <span style="color: #268bd2;">b</span> = []
        <span style="color: #268bd2;">k</span> = 0
        <span style="color: #859900;">while</span> k&lt;no_a_i:
            <span style="color: #268bd2;">u_other_action</span> = payoffi_builder(game,k,i)
            A.append(u_other_action - u_action)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">elementwise difference</span>
            b.append(0.)
            <span style="color: #268bd2;">k</span>+=1
        <span style="color: #268bd2;">p</span> = LP(f, A=A,b=b,lb=lb,ub=ub,Aeq=Aeq,beq=beq)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">we use the artificial minimization problem under the constraint that action gives a weakly higher payoff than any other action; if no feasible solution is obtained than action is dominated</span>
        <span style="color: #268bd2;">p.iprint</span> = -1
        <span style="color: #268bd2;">r</span> = p.minimize(<span style="color: #2aa198;">'pclp'</span>)
        <span style="color: #859900;">if</span> r.stopcase!=1:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">if no feasible solution was obtained then action is dominated...</span>
            <span style="color: #268bd2;">temp_game</span> = np.delete(temp_game,j,n-i-1)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">...and therefore action j is removed; recall that players are "in the wrong order"</span>
            <span style="color: #268bd2;">count</span> = 0
            <span style="color: #268bd2;">z</span> = -1
            <span style="color: #859900;">while</span> count&lt;=j:
                <span style="color: #268bd2;">z</span>+=1
                <span style="color: #859900;">if</span> undominated[i][z]!=-1 :
                    <span style="color: #268bd2;">count</span>+=1 
            undominated[i][z] = -1
        <span style="color: #268bd2;">j</span>+=1
    <span style="color: #859900;">return</span> temp_game


<span style="color: #859900;">def</span> <span style="color: #268bd2;">del_dom_a_Pi_point_belief</span>(game, i,no_i_a):
    <span style="color: #268bd2;">to_delete</span> = []
    <span style="color: #268bd2;">U</span>=[]
    <span style="color: #859900;">for</span> action <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(no_i_a):
        U.append(payoffi_builder(game,action,i))
    <span style="color: #268bd2;">Umax</span> = <span style="color: #859900;">max</span>(U)
    <span style="color: #859900;">for</span> action <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(no_i_a):
        <span style="color: #859900;">if</span> U[action]!=Umax:
            to_delete.append(action)
            <span style="color: #268bd2;">count</span> = 0
            <span style="color: #268bd2;">z</span> = -1
            <span style="color: #859900;">while</span> count&lt;=action:
                <span style="color: #268bd2;">z</span>+=1
                <span style="color: #859900;">if</span> undominated[i][z]!=-1 :
                    <span style="color: #268bd2;">count</span>+=1 
            undominated[i][z] = -1
    <span style="color: #859900;">for</span> action <span style="color: #859900;">in</span> to_delete[::-1]:
        <span style="color: #268bd2;">game</span> = np.delete(game,action,n-i-1)
    <span style="color: #859900;">return</span> game


<span style="color: #268bd2;">flag</span> = 0<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will be zero as long as not all dominated actions are removed yet</span>

<span style="color: #586e75; font-style: italic;">##</span><span style="color: #586e75; font-style: italic;">will contain undominated actions</span>
<span style="color: #268bd2;">undominated</span> = [<span style="color: #859900;">range</span>(item) <span style="color: #859900;">for</span> item <span style="color: #859900;">in</span> no_a]

<span style="color: #268bd2;">temp1</span> = payoffs
<span style="color: #859900;">while</span> flag==0:
    <span style="color: #268bd2;">temp2</span> = temp1
    <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(n):
        <span style="color: #268bd2;">temp1</span> = delete_dom_act_Pi(temp1,k)
    <span style="color: #859900;">if</span> temp2.shape == temp1.shape:
        <span style="color: #268bd2;">flag</span> = 1


<span style="color: #859900;">print</span> <span style="color: #2aa198;">'game table without non-rationalizable actions is'</span>, temp1


<span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(n):
    <span style="color: #268bd2;">undominated</span>[k] = [item <span style="color: #859900;">for</span> item <span style="color: #859900;">in</span> undominated[k] <span style="color: #859900;">if</span> item!=-1]
    <span style="color: #859900;">print</span> <span style="color: #2aa198;">'rationalizable actions of player'</span>,k,<span style="color: #2aa198;">'are'</span>, undominated[k]
</pre>
</div>

<pre class="example">
game table without non-rationalizable actions is [[[[ 4.  1.  2.]]]]
rationalizable actions of player 0 are [0]
rationalizable actions of player 1 are [1]
rationalizable actions of player 2 are [0]
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
 <p>author: Christoph Schottmueller <br> license: Creative Commons Attribution ShareAlike 4.0</p>
</div>
</body>
</html>
